Repository: michelmbem/AddyScript
Catalog: src/AddyScript/Properties/Resources.*.resx
Languages: es, fr, pt

# NoMatchingProperty
source: No matching property found in {0}
es: No se encontró ninguna propiedad coincidente en {0}
fr: Impossible de trouver la propriété correspondante dans {0}
pt: Nenhuma propriedade correspondente encontrada em {0}

# NonStaticMember
source: {0} is not static
es: {0} no es estático
fr: {0} n'est pas statique
pt: {0} não é estático

# NotAReference
source: The given expression is not a reference
es: La expresión dada no es una referencia.
fr: L'expression donnée n'est pas une référence
pt: A expressão dada não é uma referência

# NotAVariable
source: {0} is not a variable
es: {0} no es una variable
fr: {0} n'est pas une variable
pt: {0} não é uma variável

# NotEnumerable
source: The object's type is not enumerable
es: El tipo de objeto no es enumerable.
fr: Le type de l'objet n'est pas énumérable
pt: O tipo do objeto não é enumerável

# ObjectInInvalidState
source: The object is in an intermediary state. It requires some initialization to support the expected operation.
es: El objeto se encuentra en un estado intermedio. Requiere cierta inicialización para admitir la operación esperada.
fr: L'object est dans un état intermédiaire. Il a besoin d'une initialisation pour supporter l'opération sollicitée.
pt: O objeto está em um estado intermediário. Requer alguma inicialização para suportar a operação esperada.

# OnlyBoolIntOrString
source: Expected: a boolean, an integer or a string value
es: Se esperaba: un valor booleano, entero o de cadena
fr: Attendue: une valeur de type booléen, entier ou chaîne
pt: Esperado: um valor booleano, inteiro ou string

# OperatorCantBeApplied
source: Operator {0} cannot be applied to {1}
es: El operador {0} no se puede aplicar a {1}
fr: L'opérateur {0} n'est pas applicable au type {1}
pt: O operador {0} não pode ser aplicado a {1}

# PackInvalidFormat
source: Invalid format for a call to pack or unpack
es: Formato no válido para una llamada para empacar o desempacar
fr: Format invalide pour un appel à pack ou unpack
pt: Formato inválido para uma chamada para empacotar ou descompactar

# PackValuesDontMatchFormat
source: The number of values supplied doesn't match the number of format specifiers
es: La cantidad de valores proporcionados no coincide con la cantidad de especificadores de formato
fr: Le nombre de valeurs fournies ne correspond pas au nombre de spécificateurs définis dans le format
pt: O número de valores fornecidos não corresponde ao número de especificadores de formato

# ParameterIsNotOptional
source: Parameter {0} of {1} is not optional
es: El parámetro {0} de {1} no es opcional
fr: Le paramètre {0} de {1} n'est pas optionnel
pt: O parâmetro {0} de {1} não é opcional

# ParameterNameExpected
source: A parameter name is expected here
es: Aquí se espera un nombre de parámetro
pt: É esperado um nome de parâmetro aqui.

# ParameterSuppliedTwice
source: Several arguments are supplied for parameter {0}
es: Se proporcionan varios argumentos para el parámetro {0}
fr: Plusieurs arguments sont fournis pour le paramètre {0}
pt: Vários argumentos são fornecidos para o parâmetro {0}

# PropertyHidesHomonymous
source: Property {0} hides an inherited homonymous field, method or event
es: La propiedad {0} oculta un campo, método o evento homónimo heredado
fr: La propriété {0} masque un champ, une méthode ou un évènement hérité du même nom
pt: A propriedade {0} oculta um campo, método ou evento homônimo herdado

# PropertyNotFoundInClass
source: There is no {0} property in class {1}
es: No hay ninguna propiedad {0} en la clase {1}
fr: Il n'y a pas de propriété {0} dans la classe {1}
pt: Não há nenhuma propriedade {0} na classe {1}

# PropertyNotFoundInObject
source: The object has no {0} property
es: El objeto no tiene ninguna propiedad {0}
fr: L'objet n'a pas de propriété {0}
pt: O objeto não tem propriedade {0}

# PropertyUsedAsMethod
source: {0} is a property but is used as a method
es: {0} es una propiedad pero se utiliza como método
fr: {0} est une propriété mais est invoqué comme une méthode
pt: {0} é uma propriedade, mas é usado como método

# ScriptCannotReturnValue
source: The script cannot return a value
es: El script no puede devolver un valor
fr: Le script ne peut pas retourner de valeur
pt: O script não pode retornar um valor

# SingleCharExpected
source: Argument {0} of '{1}' must be a single character
es: El argumento {0} de '{1}' debe ser un solo carácter
fr: L'argument {0} de la fonction {1} doit être un caractère unique
pt: O argumento {0} de '{1}' deve ser um único caractere

# SingleConstructor
source: A constructor is already defined for this class
es: Ya hay un constructor definido para esta clase.
fr: La classe a déjà un constructeur
pt: Um construtor já está definido para esta classe

# SingleIndexer
source: An indexer is already defined for this class
es: Ya hay un indexador definido para esta clase.
fr: La classe a déjà un indexeur
pt: Um indexador já está definido para esta classe

# SlicingNotSupported
source: The {0} type does not have support for slice extraction
es: El tipo {0} no admite la extracción de sectores
pt: O tipo {0} não tem suporte para extração de fatia

# SpecificFieldModifier
source: The combination of the 'static' and 'final' modifiers can only be applied to a field
es: La combinación de los modificadores 'estático' y 'final' solo se puede aplicar a un campo
fr: La combinaison des modificateurs 'static' et 'final' ne peut être appliquée qu'à un champ
pt: A combinação dos modificadores 'estático' e 'final' só pode ser aplicada a um campo

# StatementRequired
source: A statement is required
es: Se requiere una declaración
fr: Un instruction est attendue
pt: É necessária uma declaração

# StaticClassHasNoSuperClass
source: A static class cannot have a superclass. Either remove the 'static' keyword or remove the superclass specification
es: Una clase estática no puede tener una superclase. Elimine la palabra clave 'estática' o elimine la especificación de superclase
fr: Une classe statique ne peut hériter d'une autre. Choisir entre le retrait du modificateur 'static' et la suppression de la clause d'héritage
pt: Uma classe estática não pode ter uma superclasse. Remova a palavra-chave 'static' ou remova a especificação da superclasse

# StaticClassMember
source: Any member of a static class must be static
es: Cualquier miembro de una clase estática debe ser estático.
fr: Tout membre d'une classe statique doit également être statique
pt: Qualquer membro de uma classe estática deve ser estático

source: Strings are immutable
es: Las cadenas son inmutables
fr: Les chaînes sont immuables
pt: Strings são imutáveis

# SuperUsedOutOfMethod
source: The keyword 'super' cannot be used out of a method's body
es: La palabra clave 'super' no se puede utilizar fuera del cuerpo de un método.
fr: L'usage du mot-clé 'super' est illégal en dehors du corps d'une méthode
pt: A palavra-chave 'super' não pode ser usada fora do corpo de um método

# ThisUsedOutOfMethod
source: The keyword 'this' cannot be used out of a non-static method's body
es: La palabra clave 'this' no se puede utilizar fuera del cuerpo de un método no estático.
fr: L'usage du mot-clé 'this' est illégal en dehors du corps d'une méthode non-statique
pt: A palavra-chave 'this' não pode ser usada fora do corpo de um método não estático

# TooFewArgs
source: Too few arguments for a call to {0}
es: Muy pocos argumentos para una llamada a {0}
fr: Pas assez d'arguments pour un appel à {0}
pt: Poucos argumentos para uma chamada para {0}

# TooManyArgs
source: Too many arguments for a call to {0}
es: Demasiados argumentos para una llamada a {0}
fr: Trop d'arguments pour un appel à {0}
pt: Muitos argumentos para uma chamada para {0}

source: Tuples are immutable
es: Las tuplas son inmutables.
pt: Tuplas são imutáveis

# TypeDoesNotSupportFunction
source: Function {0} does not accept arguments of type {1}
es: La función {0} no acepta argumentos de tipo {1}
fr: La fonction {0} n'accepte pas d'argument du type {1}
pt: A função {0} não aceita argumentos do tipo {1}

# TypeNameExpected
source: A type name or pattern is expected
es: Se espera un nombre de tipo o patrón.
fr: Nom de type réquis
pt: Um nome de tipo ou padrão é esperado

# UnableToFindMethod
source: Unable to find the corresponding method in {0}
es: No se puede encontrar el método correspondiente en {0}
fr: Impossible de trouver la méthode correspondante dans {0}
pt: Não foi possível encontrar o método correspondente em {0}

# UndefinedFunction
source: Function {0} is undefined
es: La función {0} no está definida
fr: La fonction {0} n'existe pas
pt: A função {0} é indefinida

# UndefinedSymbol
source: Could not find any symbol named {0}
es: No se pudo encontrar ningún símbolo llamado {0}
pt: Não foi possível encontrar nenhum símbolo chamado {0}

# UndefinedType
source: Type or namespace {0} is undefined
es: El tipo o espacio de nombres {0} no está definido
fr: Le type ou l'espace de noms {0} n'existe pas
pt: O tipo ou namespace {0} é indefinido

# UndefinedVariable
source: Variable {0} is undefined
es: La variable {0} no está definida
fr: La variable {0} n'existe pas
pt: A variável {0} é indefinida

# UnexpectedToken
source: Unexpected token {0}
es: Token inesperado {0}
fr: Rencontre inopportune du symbole {0}
pt: Token inesperado {0}

# UninitializedVariable
source: Variable {0} has not been set a value
es: A la variable {0} no se le ha asignado un valor
fr: La variable {0} n'a pas encore été initialisée
pt: A variável {0} não recebeu um valor definido

# UnorderedType
source: Type {0} does not have a predefined order
es: El tipo {0} no tiene un orden predefinido
fr: Le type {0} n'a pas d'ordre prédéfini
pt: O tipo {0} não possui uma ordem predefinida

# UnoverloadableOperator
source: {0} is not an overloadable operator
es: {0} no es un operador sobrecargable
fr: {0} n'est pas un opérateur surchargeable
pt: {0} não é um operador sobrecarregável

# UnresolvedMemberRef
source: Unresolved member reference: {0}
es: Referencia de miembro no resuelta: {0}
fr: Impossible de résoudre la référence au membre: {0}
pt: Referência de membro não resolvida: {0}

# UseParserForInlineFuncs
source: Please use Parser to recognize inline functions and lambda expressions
es: Utilice Parser para reconocer funciones en línea y expresiones lambda
fr: Bien vouloir utiliser Parser pour la reconnaissance des "fonctions en-ligne"
pt: Use o Parser para reconhecer funções embutidas e expressões lambda

# VaArgsMustBeTheLast
source: A variably sized list of arguments must be the last in the function's header
es: Una lista de argumentos de tamaño variable debe ser la última en el encabezado de la función.
fr: Une liste d'aguments de longueur variable doit toujours figurer en fin de liste
pt: Uma lista de argumentos de tamanho variável deve ser a última no cabeçalho da função

# ValueShouldNotBeEmpty
source: The value should not be empty
es: El valor no debe estar vacío.
fr: La valeur de l'objet ne peut être vide
pt: O valor não deve estar vazio

# YieldUsedOutOfIterator
source: yield can only be used in an iterator
es: El rendimiento solo se puede utilizar en un iterador.
pt: rendimento só pode ser usado em um iterador

# EmptyPatternGroup
source: A pattern was expected between parentheses
es: Se esperaba una coincidencia de patrones entre los paréntesis.
pt: Era esperado que houvesse uma correspondência de padrões entre os parênteses.

# InvalidStringDestructuringSubstitution
source: Invalid string destructuring substitution : only variable names are allowed
pt: Substituição de desestruturação de string inválida: somente nomes de variáveis ​​são permitidos.

# RecordCannotDefineConstructor
source: A record class cannot explicitly define a constructor.
pt: Uma classe de registro não pode definir explicitamente um construtor.
