Repository: michelmbem/AddyScript
Catalog: src/AddyScript/Properties/Resources.*.resx
Languages: es, fr, pt

# AbnormalListTermination
source: abnormal list termination, another item was expected
es: terminación anormal de la lista, se esperaba otro elemento
pt: encerramento anormal da lista, outro item era esperado

# AbstractMemberCantHaveBody
source: An abstract member can't have a body
es: Un miembro abstracto no puede tener un cuerpo
fr: Un membre abstrait ne peut pas avoir de corps
pt: Um membro abstrato não pode ter um corpo

# AbstractMemberInNonAbstractClass
source: A non abstract class cannot have abstract members
es: Una clase no abstracta no puede tener miembros abstractos
pt: Uma classe não abstrata não pode ter membros abstratos

# AccessDenied
source: Cannot access to {0} from {1}
es: No se puede acceder a {0} desde {1}
fr: Impossible d'accéder à {0} à partir de {1}
pt: Não é possível acessar {0} de {1}

# AccessorScopeMustBeMoreRestrictive
source: The scope of an accessor must be more restrictive than the property's scope
es: El alcance de un descriptor de acceso debe ser más restrictivo que el alcance de la propiedad.
fr: La portée d'un accesseur doit être plus restrictive que la portée de la propriété
pt: O escopo de um acessador deve ser mais restritivo que o escopo da propriedade

# ArgMustBeOfType
source: Argument {0} of '{1}' must be of the {2} type
es: El argumento {0} de '{1}' debe ser del tipo {2}
fr: L'argument {0} de la fonction {1} doit être de type {2}
pt: O argumento {0} de '{1}' deve ser do tipo {2}

# AttributesNotSupported
source: The following statement does not support attributes
es: La siguiente declaración no admite atributos
fr: L'instruction suivante ne supporte pas les attributs
pt: A instrução a seguir não oferece suporte a atributos

# BadDateOfCall
source: date::of expects 3, 4, 6 or 7 arguments. The number or arguments ({0}) provided is invalid.
es: date::of espera 3, 4, 6 o 7 argumentos. El número o los argumentos ({0}) proporcionados no son válidos.
pt: date::of espera 3, 4, 6 ou 7 argumentos. O número ou argumentos ({0}) fornecidos são inválidos.

# BothAccessorsCantRedefineScope
source: The scope cannot be redefined for both accessors of a property
es: El alcance no se puede redefinir para ambos descriptores de acceso de una propiedad
pt: O escopo não pode ser redefinido para ambos os acessadores de uma propriedade

# CalleeIsNotClosure
source: The given expression is not a closure
es: La expresión dada no es un cierre.
fr: L'expression fournie n'est pas une fermeture
pt: A expressão dada não é um fechamento

# CannotAccessAbstractProperty
source: Cannot access to abstract property {0}
es: No se puede acceder a la propiedad abstracta {0}
fr: Impossible d'accéder à la propriété abstraite {0}
pt: Não é possível acessar a propriedade abstrata {0}

# CannotAlterConstant
source: Cannot alter a constant object
es: No se puede alterar un objeto constante
fr: Impossible de modifier un objet constant
pt: Não é possível alterar um objeto constante

# CannotComputeGcdForNegative
source: Cannot compute the Gcd of negative numbers
es: No se puede calcular el MCD de números negativos
pt: Não é possível calcular o Mdc de números negativos

# CannotConvert
source: Cannot convert from {0} to {1}
es: No se puede convertir de {0} a {1}
fr: Impossible de convertir de {0} à {1}
pt: Não é possível converter de {0} para {1}

# CannotConvertFrom
source: Cannot automatically handle conversions from {0}
es: No se pueden gestionar automáticamente las conversiones de {0}
fr: La conversion automatique depuis {0} n'est pas prise en charge
pt: Não é possível processar conversões automaticamente de {0}

# CannotConvertTo
source: Cannot convert the expression to {0}
es: No se puede convertir la expresión a {0}
fr: Impossible de convertir l'expression vers {0}
pt: Não é possível converter a expressão em {0}

# CannotCreateEmptyTuple
source: Could not create an empty tuple
es: No se pudo crear una tupla vacía
pt: Não foi possível criar uma tupla vazia

# CannotCreateInstance
source: Cannot create an instance of abstract or static class {0}
es: No se puede crear una instancia de clase abstracta o estática {0}
fr: Impossible de créer une instance de la classe statique ou abstraite {0}
pt: Não é possível criar uma instância da classe abstrata ou estática {0}

# CannotCreateSubclass
source: Cannot create a subclass of final or static class {0}
es: No se puede crear una subclase de clase final o estática {0}
fr: Impossible d'hériter de la classe finale ou statique {0}
pt: Não é possível criar uma subclasse da classe final ou estática {0}

# CannotInvokeAbstractMember
source: Cannot invoke abstract member {0}
es: No se puede invocar el miembro abstracto {0}
fr: Impossible d'invoquer le membre abstrait {0}
pt: Não é possível invocar o membro abstrato {0}

# CannotJumpOutOfFinallyBlock
source: Cannot jump out of the finally block
es: No puedo saltar del bloque final
fr: Impossible de faire un saut en dehors du bloc 'finally'
pt: Não é possível pular do bloco final

# CannotReadProperty
source: Cannot read a write-only property
es: No se puede leer una propiedad de solo escritura
fr: Impossible de lire une propriété en écriture seule
pt: Não é possível ler uma propriedade somente gravação

# CannotReturnFromFinallyBlock
source: Cannot return from the finally block
es: No se puede regresar del bloque finalmente
fr: L'instruction 'return' est illégale à l'intérieur du bloc 'finally'
pt: Não é possível retornar do bloco final

# CannotWriteFinalField
source: Cannot change the value of a final field
es: No se puede cambiar el valor de un campo final
fr: Impossible de changer la valeur d'un champ final
pt: Não é possível alterar o valor de um campo final

# CannotWriteProperty
source: Cannot write a read-only property
es: No se puede escribir una propiedad de solo lectura
fr: Impossible d'écrire une propriété en lecture seule
pt: Não é possível gravar uma propriedade somente leitura

# CaseLabelRequired
source: A switch block must contain at least one case label
es: Un bloque de interruptores debe contener al menos una etiqueta de caja.
fr: Un bloc 'switch' doit contenir au moins une étiquette 'case'
pt: Um bloco de comutação deve conter pelo menos um rótulo de caso

# CatchOrFinallyBlockRequired
source: A try statement without resource should have either a catch block or a finally block
es: Una declaración de prueba sin recursos debe tener un bloque catch o un bloque finalmente
fr: Une instruction try sans resource devrait avoir un bloc try ou un bloc finally
pt: Uma instrução try sem recurso deve ter um bloco catch ou um bloco finalmente

# ClassHasNoIndexReader
source: Type {0} does not support reading element by index
es: El tipo {0} no admite la lectura de elemento por índice
pt: O tipo {0} não suporta leitura de elemento por índice

# ClassHasNoIndexWriter
source: Type {0} does not support writing element by index
es: El tipo {0} no admite la escritura elemento por índice
pt: O tipo {0} não suporta gravação de elemento por índice

# ClassHasNoProperty
source: Type {0} has no property named {1}
es: El tipo {0} no tiene ninguna propiedad denominada {1}
fr: Le type {0} n'a aucune propriété
pt: O tipo {0} não possui propriedade chamada {1}

# ClassHasNoRangeReader
source: Type {0} has no support for slice extraction
es: El tipo {0} no admite la extracción de sectores
pt: O tipo {0} não tem suporte para extração de fatia

# ClassHasNoRangeWriter
source: Type {0} has no support for slice replacement
es: El tipo {0} no admite el reemplazo de sectores
pt: O tipo {0} não tem suporte para substituição de fatia

# ConstantFieldShouldBeInitialized
source: A constant field should be initialized upon declaration
es: Un campo constante debe inicializarse tras la declaración.
fr: Un champ constant doit être initialisé dès sa déclaration
pt: Um campo constante deve ser inicializado na declaração

# ConstructorCantReturnValue
source: A constructor is not allowed to return a value
es: Un constructor no puede devolver un valor
fr: Le constructeur ne peut pas retourner de valeur
pt: Um construtor não tem permissão para retornar um valor

# DuplicatedAttribute
source: Each attribute must be unique in the list
es: Cada atributo debe ser único en la lista.
fr: Chaque attribut doit être unique dans la liste
pt: Cada atributo deve ser único na lista

# DuplicatedAttributeField
source: Each field in an attribute must be unique
es: Cada campo de un atributo debe ser único
pt: Cada campo em um atributo deve ser único.

# DuplicatedAttributeValue
source: The attribute value can only be set once
es: El valor del atributo solo se puede configurar una vez
pt: O valor do atributo só pode ser definido uma vez.

# DuplicatedCaseLabel
source: Each case label must be unique in a swith block
es: Cada etiqueta de caja debe ser única en un bloque de interruptores.
fr: Chaque étiquette 'case' doit être unique dans un bloc 'switch'
pt: Cada rótulo de caso deve ser exclusivo em um bloco de switch

# DuplicatedConstant
source: Each constant must be unique
es: Cada constante debe ser única.
fr: Chaque constante doit être unique
pt: Cada constante deve ser única

# DuplicatedItem
source: Each value must be unique in a set
es: Cada valor debe ser único en un conjunto.
fr: Chaque élément doit être unique
pt: Cada valor deve ser único em um conjunto

# DuplicatedKey
source: Each item of a map must have a unique key
es: Cada elemento de un mapa debe tener una clave única.
fr: Chaque élément d'une carte doit avoir une clé unique
pt: Cada item de um mapa deve ter uma chave única

# DuplicatedLabel
source: A {0} label already exists in the current scope
es: Ya existe una etiqueta {0} en el ámbito actual
fr: L'étiquette {0} est déjà déclarée dans la portée courante
pt: Já existe um rótulo {0} no escopo atual

# DuplicatedParameter
source: Each parameter must be unique in the list
es: Cada parámetro debe ser único en la lista.
fr: Chaque paramètre doit être unique dans la liste
pt: Cada parâmetro deve ser único na lista

# DuplicatedProperty
source: Each property of an object must have a unique name
es: Cada propiedad de un objeto debe tener un nombre único.
fr: Chaque propriété de l'objet doit être unique
pt: Cada propriedade de um objeto deve ter um nome exclusivo

# DuplicatedVariable
source: Each variable must be declared once in its scope
es: Cada variable debe declararse una vez en su alcance.
fr: Chaque variable doit être unique dans sa portée
pt: Cada variável deve ser declarada uma vez em seu escopo

# EventDeclaredInAncestor
source: Event {0} is already declared in ancestor {1}
es: El evento {0} ya está declarado en el antecesor {1}
fr: L'évènement {0} est déjà déclaré dans l'ancêtre {1}
pt: O evento {0} já foi declarado no ancestral {1}

# EventHidesHomonymous
source: Event {0} hides an inherited homonymous field, property or method
es: El evento {0} oculta un campo, propiedad o método homónimo heredado
fr: L'évènement {0} masque un champ, une propriété ou une méthode hérité du même nom
pt: O evento {0} oculta um campo, propriedade ou método homônimo herdado

# ExpressionRequired
source: An expression is required
es: Se requiere una expresión
fr: Expression attendue
pt: É necessária uma expressão

# FieldDeclaredInAncestor
source: Field {0} is already declared in ancestor {1}
es: El campo {0} ya está declarado en el antecesor {1}
fr: Le champ {0} est déjà défini dans l'ancêtre {1}
pt: O campo {0} já está declarado no ancestral {1}

# FieldHidesHomonymous
source: Field {0} hides an inherited homonymous property, method or event
es: El campo {0} oculta una propiedad, método o evento homónimo heredado
fr: Le champ {0} masque une propiété, une méthode ou un évènement hérité du même nom
pt: O campo {0} oculta uma propriedade, método ou evento homônimo herdado

# FunctionHasNoParameterNamed
source: {0} has no parameter named {1}
es: {0} no tiene ningún parámetro llamado {1}
fr: {0} ne possède pas de paramètre nommé {1}
pt: {0} não tem parâmetro chamado {1}

# IndexerCantBeAuto
source: Automatic accessors generation is not supported for indexers
es: La generación automática de accesos no es compatible con los indexadores
fr: La génération automatique d'accesseurs n'est pas prise en charge pour les indexeurs
pt: A geração automática de acessadores não é compatível com indexadores

# IndexerCantBeStatic
source: An indexer cannot be static
es: Un indexador no puede ser estático
fr: Indexeur ne peut pas être static
pt: Um indexador não pode ser estático

# IndexNotFound
source: There is no item {0} in the collection
es: No hay ningún elemento {0} en la colección
fr: La collection ne contient pas d'élément de rang {0}
pt: Não há item {0} na coleção

# InvalidAccessorsScope
source: At least, one accessor must have the same scope than the property
es: Al menos, un descriptor de acceso debe tener el mismo alcance que la propiedad.
fr: Au moins, l'un des accesseurs doit avoir la même portée que la propriété elle-même
pt: Pelo menos um acessador deve ter o mesmo escopo que a propriedade

# InvalidConstantType
source: A constant cannot be of the {0} type. Only bool, int, long, float, decimal, complex, date and string are accepted
es: Una constante no puede ser del tipo {0}. Sólo se aceptan bool, int, long, float, decimal, complex, date y string.
fr: Une constante ne peut pas être du type {0}. Seuls bool, int, long, float, decimal, complex, date et string sont acceptés
pt: Uma constante não pode ser do tipo {0}. Somente bool, int, long, float, decimal, complex, date e string são aceitos

# InvalidConstructorModifier
source: No modifier is allowed for the constructor
es: No se permite ningún modificador para el constructor.
fr: Aucun modificateur ne doit être précisé pour le constructeur
pt: Nenhum modificador é permitido para o construtor

# InvalidDatePart
source: '{0}' is not a valid date part. Only 'year', 'month', 'yearday', 'weekday', 'day', 'hour', 'minute', 'second' and 'millisecond' are accepted.
es: '{0}' no es una parte de fecha válida. Sólo se aceptan "año", "mes", "día del año", "día de la semana", "día", "hora", "minuto", "segundo" y "milisegundo".
fr: '{0}' n'est pas valide comme partie de date. Seuls 'year', 'month', 'yearday', 'weekday', 'day', 'hour', 'minute', 'second' and 'millisecond' sont acceptés.
pt: '{0}' não é uma parte de data válida. Apenas 'ano', 'mês', 'dia do ano', 'dia da semana', 'dia', 'hora', 'minuto', 'segundo' e 'milissegundo' são aceitos.

# InvalidDateUnit
source: '{0}' is not a valid unit of time. Only 'year', 'month', 'day', 'hour', 'minute', 'second' and 'millisecond' are accepted.
es: '{0}' no es una unidad de tiempo válida. Sólo se aceptan "año", "mes", "día", "hora", "minuto", "segundo" y "milisegundo".
fr: '{0}' n'est pas une unité de temps valide. Seuls 'year', 'month', 'day', 'hour', 'minute', 'second' et 'millisecond' sont acceptées.
pt: '{0}' não é uma unidade de tempo válida. Apenas 'ano', 'mês', 'dia', 'hora', 'minuto', 'segundo' e 'milissegundo' são aceitos.

# InvalidEvalParam
source: The given string does not contain a valid expression
es: La cadena dada no contiene una expresión válida
fr: La chaîne fournie ne contient pas d'expression valide
pt: A string fornecida não contém uma expressão válida

# InvalidFieldModifier
source: Modifier '{0}' cannot be applied to a field
es: El modificador '{0}' no se puede aplicar a un campo
fr: Le modificateur {0} n'est pas applicable aux champs
pt: O modificador '{0}' não pode ser aplicado a um campo

# InvalidLValue
source: The left operand is not a valid lvalue
es: El operando izquierdo no es un valor l válido
fr: L'opérande de gauche n'est pas une adresse
pt: O operando esquerdo não é um valor válido

# InvalidMemberModifier
source: Invalid modifier for member {0}. Only 'final' is allowed
es: Modificador no válido para el miembro {0}. Sólo se permite 'final'
fr: Modificateur inapproprié pour le membre {0}. Seul 'final' conviendrait
pt: Modificador inválido para membro {0}. Apenas 'final' é permitido

# InvalidNewUsage
source: Invalid expression termination; an object initializer or a call to a constructor is expected
es: Terminación de expresión no válida; Se espera un inicializador de objeto o una llamada a un constructor.
fr: L'expression se termine incorrectement; un initialiseur d'objet ou un appel de constructeur est attendu
pt: Terminação de expressão inválida; um inicializador de objeto ou uma chamada para um construtor é esperado

# InvalidOperandCount
source: Invalid operands count for operator {0}
es: Recuento de operandos no válidos para el operador {0}
fr: Nombre d'opérandes invalide pour l'opérateur {0}
pt: Contagem de operandos inválidos para o operador {0}

# InvalidOperandForWith
source: The left operand of 'with' must be a record
es: El operando izquierdo de 'con' debería ser un objeto
fr: L'operande de gauche de 'with' doit être un objet
pt: O operando à esquerda de 'with' deve ser um registro.

# InvalidOperatorModifier
source: No modifier is allowed for an operator overloading
es: No se permite ningún modificador por sobrecarga del operador.
fr: Aucun modificateur ne doit être précisé pour une surcharge d'opérateur
pt: Nenhum modificador é permitido para uma sobrecarga do operador

# InvalidTypeReference
source: Invalid external type reference: {0}
es: Referencia de tipo externo no válida: {0}
fr: Référence de type externe incorrecte: {0}
pt: Referência de tipo externo inválida: {0}

# IterationNotSupported
source: Cannot iterate through a variable of type {0}
es: No se puede iterar a través de una variable de tipo {0}
fr: Impossible d'énumérer une variable de type {0}
pt: Não é possível iterar por meio de uma variável do tipo {0}

# IteratorCantReturnValue
source: An iterator cannot return any value
es: Un iterador no puede devolver ningún valor.
pt: Um iterador não pode retornar nenhum valor

# JumpToCaseLabelOutOfSwitchBlock
source: The script is trying to jump to a case label out of a switch block
es: El script intenta saltar a la etiqueta de un caso desde un bloque de interruptores.
fr: Le script essaie de faire un saut vers une étiquette de cas en dehors d'un bloc switch
pt: O script está tentando pular para um rótulo de caso de um bloco de switch

# ListCantBeEmpty
source: The list of variables can't be empty
es: La lista de variables no puede estar vacía.
pt: A lista de variáveis ​​não pode estar vazia

# ListLengthMismatch
source: Both lists should have the same length
es: Ambas listas deben tener la misma longitud.
pt: Ambas as listas devem ter o mesmo comprimento

# LiteralRequired
source: The expression must be a literal value
es: La expresión debe ser un valor literal.
fr: L'expression doit être une valeur litérale
pt: A expressão deve ser um valor literal

# MandatoryParamsPrecede
source: A mandatory parameter cannot follow an optional one
es: Un parámetro obligatorio no puede seguir a uno opcional
fr: Un paramètre obligatoire ne peut suivre un paramètre optionnel
pt: Um parâmetro obrigatório não pode seguir um parâmetro opcional

# MemberCantOverride
source: Member {0} cannot be overriden
es: El miembro {0} no se puede anular
fr: Le membre {0} ne peut pas être redéfini
pt: O membro {0} não pode ser substituído

# MemberNameConfict
source: Another member is declared with the name {0}
es: Se declara otro miembro con el nombre {0}
fr: Un autre membre est déjà déclaré avec le nom {0}
pt: Outro membro é declarado com o nome {0}

# MethodHidesHomonymous
source: Method {0} hides an inherited homonymous field, property or event
es: El método {0} oculta un campo, propiedad o evento homónimo heredado
fr: La méthode {0} masque un champ, une propriété ou un évènement hérité du même nom
pt: O método {0} oculta um campo, propriedade ou evento homônimo herdado

# MethodNotFound
source: There is no {0} method in class {1}
es: No hay ningún método {0} en la clase {1}
fr: Il n'y a pas de méthode {0} dans la classe {1}
pt: Não há método {0} na classe {1}

# MethodUsedAsProperty
source: {0} is a method but is used as a property
es: {0} es un método pero se usa como propiedad
fr: {0} est une méthode mais est utilisée comme un propriété
pt: {0} é um método, mas é usado como uma propriedade

# MissingAttribute
source: No '{0}' attribute is attached to the {1} external function
es: No se adjunta ningún atributo '{0}' a la función externa {1}
fr: Aucun attribut '{0}' n'est associé à la fonction externe {1}
pt: Nenhum atributo '{0}' está anexado à função externa {1}

# MissingAttributeProperty
source: A '{0}' field is missing in the '{1}' attribute
es: Falta un campo '{0}' en el atributo '{1}'
fr: Il manque un champ '{0}' dans la définition de l'attribut '{1}'
pt: Um campo '{0}' está faltando no atributo '{1}'

# MissingClosingBrace
source: A '}' is missing
es: Falta un '}'
fr: Il manque un '}'
pt: Um '}' está faltando

# MissingClosingParen
source: Missing closing parenthesis
es: Falta paréntesis de cierre
fr: Parenthèse fermante attendue
pt: Faltando parênteses de fechamento

# MissingLabel
source: Label '{0}' is not declared in the current scope
es: La etiqueta '{0}' no está declarada en el ámbito actual
fr: L'étiquette {0} n'est pas déclarée dans la portée en cours
pt: O rótulo '{0}' não foi declarado no escopo atual

# MissingPameter
source: No value was supplied for the '{0}' parameter of {1}
es: No se proporcionó ningún valor para el parámetro '{0}' de {1}
fr: Aucun argument n'est fourni pour le paramètre {0} de {1}
pt: Nenhum valor foi fornecido para o parâmetro '{0}' de {1}

# ModuleNotFound
source: Cannot load module {0}. Check the 'ImportPaths' property of your ScriptContext
es: No se puede cargar el módulo {0}. Verifique la propiedad 'ImportPaths' de su ScriptContext
fr: Impossible de charger le module {0}. Vérifier que la propriété 'SearchPath' de l'objet ScriptContext est correctement initialisée
pt: Não é possível carregar o módulo {0}. Verifique a propriedade 'ImportPaths' do seu ScriptContext

# MustMatchSignature
source: {0} must have the same signature than {1}
es: {0} debe tener la misma firma que {1}
fr: {0} devrait avoir la même signature que {1}
pt: {0} deve ter a mesma assinatura que {1}

# MustOverride
source: {0} must either override {1} or be marked as abstract
es: {0} debe anular a {1} o marcarse como resumen
fr: {0} devrait soit surcharger {1}, soit être marquée comme classe abstraite
pt: {0} deve substituir {1} ou ser marcado como abstrato

# NameConflict
source: The name {0} is already in use
es: El nombre {0} ya está en uso
fr: Le nom {0} sert déjà à identifier un autre objet
pt: O nome {0} já está em uso

# NoBreakOutOfLoop
source: The keyword 'break' cannot be used out of a loop or a switch block
es: La palabra clave 'break' no se puede utilizar fuera de un bucle o de un bloque de conmutación
fr: Le mot clé 'break' ne peut figurer qu'à l'intérieur d'une boucle ou d'un bloc 'switch'
pt: A palavra-chave 'break' não pode ser usada fora de um loop ou bloco switch

# NoContinueOutOfLoop
source: The keyword 'continue' cannot be used out of a loop
es: La palabra clave 'continuar' no se puede utilizar fuera de un bucle
fr: Le mot clé 'continue' ne peut être utilisé qu'à l'intérieur d'une boucle
pt: A palavra-chave 'continue' não pode ser usada fora de um loop

# NoEmptyProperty
source: Either a read accessor or a write accessor must be defined
es: Se debe definir un acceso de lectura o un acceso de escritura.
fr: La propriété doit définir un accesseur au moins
pt: Um acessador de leitura ou um acessador de gravação deve ser definido

# NoMatchingIndexer
source: No matching indexer found in {0}
es: No se encontró ningún indexador coincidente en {0}
fr: Impossible de trouver l'indexeur correspondant dans {0}
pt: Nenhum indexador correspondente encontrado em {0}
